{
  "lesson" : {
    "menu_option" : "Choose the available lessons : \n + Introduction (intro) \n + Installation (install) \n + Python Version (version) \n + Script Python (script) \n + Run Python (run_program)",
    "description" : "GETTING STARTED\n\nIn this course, you will learn how to get started in Python Programming. From the introduction, installation, to running your first python program. Your journey starts here!",
    "introduction_lesson" : "INTRODUCTION\n\nPython is a widely used high-level programming language, created by Guido van Rossum the year 1991. Python is used to build programs such as Games, Web Application, Data Visualization, Robotics and even Artificial Intelligence. Python is an interpreted language, meaning the code you write will not be compiled like other compiled programming language such as C or Java. The program is translated by an interpreter so your programs can run smooth. This means your machine must have python installed first so that python programs can run. So if you want to use python, go install python at www.python.org and go to your terminal or command prompt and type 'python'.",
    "install_lesson" : "INSTALLATION\n\nPython is easy to install, if you are using Linux or Mac (UNIX) you probably already have this on your system, but if you are using Windows you have to download and install Python 2 and 3 on your system. Click the link given, it will direct you to the python website www.python.org/downloads/",
    "version_lesson" : "VERSIONS\n\nWhy is there 2 versions of Python? Should I learn both? Think of it like this, Python 2 is the legacy version of the language, while Python 3 is the cutting edge version. Although the language is basically the same, but some syntax are different. Keep in mind that you may want to pay attention on what version you want to use on your project.",
    "script_lesson" : "SCRIPTING\n\nPython has a built in Text Editor called IDLE, it can be used easily for anyone to learn python. Simply open up IDLE and make a new file, save it with .py or .pyw extension and you're good to go. You can use any text editor to write a python program. My recommendations are \n https://atom.io/ \n https://code.visualstudio.com/ \n https://www.jetbrains.com/pycharm/",
    "pyrun_lesson" : "RUN PYTHON\n\nTo write a python script or file, save the text file as .py or .pyw extension. To run the file, simply go to your terminal or command prompt and type in 'python filename.py' for python 2 and 'python3 filename.py' for python 3"
  }
}
